app/controllers/home_controller.rb

    def welcome
        @tasks = Task.all
---
SELECT "tasks".* FROM "tasks"