app/controllers/tasks_controller.rb

    def create
        @task = Task.new(params.require(:task).permit(:description, :status)) #strong parameters
        @task.save # salva a tarefa criada pelo usuario no bd
---
INSERT INTO "tasks" ("description", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "comprar bolo"], ["status", 1], ["created_at", "2020-07-13 23:58:05.140364"], ["updated_at", "2020-07-13 23:58:05.140364"]]

    def update
        @task = Task.find(params[:id])
        @task.update(params.require(:task).permit(:description, :status))
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "comprar pão"], ["updated_at", "2020-07-14 00:08:22.566219"], ["id", 1]]

        task = Task.find(params[:id]) #não precisa do @ no task pq não temos view que usara o obj
        task.destroy #destroi a tarefa de entrada
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 4]]